core/app/Http/Controllers/SiteController.php

select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `add_listings` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `add_listings`
---
    public function index(){

        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }
        $pageTitle = 'Home';
        $projects = AddListing::orderBy('id',"DESC")->paginate(10);

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
---
    public function pages($slug)
    {
        $page = Page::where('tempname',$this->activeTemplate)->where('slug',$slug)->firstOrFail();