core/app/Http/Controllers/UserPropertyController.php

select * from `add_listings` where `id` = '3' limit 1
---
     public function propertySearchDetails($id,$slug)
     {
         $pageTitle = "Project Information";
         $details = AddListing::where('id',$id)->firstOrFail();