core/app/Http/Helpers/helpers.php

select `active_template` from `general_settings` limit 1
---
function activeTemplate($asset = false)
{
    $general = GeneralSetting::first(['active_template']);

select * from `frontends` where `data_keys` = 'home_section.content' order by `id` desc limit 1
select * from `frontends` where `data_keys` = 'social_icon.element' order by `id` asc
---
function getContent($data_keys, $singleQuery = false, $limit = null,$orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->orderBy('id','desc')->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if($orderById){
            $content = $article->where('data_keys', $data_keys)->orderBy('id')->get();